/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50505
Source Host           : localhost:3306
Source Database       : ctc_smart

Target Server Type    : MYSQL
Target Server Version : 50505
File Encoding         : 65001

Date: 2019-06-07 12:58:30
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `department`
-- ----------------------------
DROP TABLE IF EXISTS `department`;
CREATE TABLE `department` (
  `d_id` int(5) NOT NULL AUTO_INCREMENT,
  `d_code` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `d_name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `t_status` varchar(10) COLLATE utf8mb4_unicode_ci DEFAULT '1',
  PRIMARY KEY (`d_id`)
) ENGINE=InnoDB AUTO_INCREMENT=69 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
-- Records of department
-- ----------------------------
INSERT INTO `department` VALUES ('34', '3204', 'คอมพิวเตอร์ธุรกิจ', '1');
INSERT INTO `department` VALUES ('35', '3111', 'เทคนิคอุตสาหกรรม', '1');
INSERT INTO `department` VALUES ('36', '3109', 'เทคโนโลยีสารสนเทศ', '1');
INSERT INTO `department` VALUES ('37', '2201', 'พณิชยการ', '1');
INSERT INTO `department` VALUES ('38', '2111', 'ซ่อมบำรุง', '1');
INSERT INTO `department` VALUES ('39', '2107', 'ช่างโยธา', '1');
INSERT INTO `department` VALUES ('40', '2106', 'ช่างก่อสร้าง', '1');
INSERT INTO `department` VALUES ('41', '2105', 'ช่างอิเล็กทรอนิกส์', '1');
INSERT INTO `department` VALUES ('42', '2104', 'ช่างไฟฟ้ากำลัง', '1');
INSERT INTO `department` VALUES ('43', '2103', 'โลหะการ', '1');
INSERT INTO `department` VALUES ('44', '2102', 'เครื่องมือกล', '1');
INSERT INTO `department` VALUES ('45', '2101', 'ช่างยนต์', '1');
INSERT INTO `department` VALUES ('46', 'การตลาด', 'การตลาด', '1');
INSERT INTO `department` VALUES ('47', 'การบัญชี', 'การบัญชี', '1');
INSERT INTO `department` VALUES ('48', 'ก่อสร้าง', 'ก่อสร้าง', '1');
INSERT INTO `department` VALUES ('49', 'คอมพิวเตอร์ธุรกิจ', 'คอมพิวเตอร์ธุรกิจ', '1');
INSERT INTO `department` VALUES ('50', 'ตัวถังและสีรถยนต์', 'ตัวถังและสีรถยนต์', '1');
INSERT INTO `department` VALUES ('51', 'ยานยนต์', 'ยานยนต์', '1');
INSERT INTO `department` VALUES ('52', 'สถาปัตยกรรม', 'สถาปัตยกรรม', '1');
INSERT INTO `department` VALUES ('53', 'อิเล็กทรอนิกส์', 'อิเล็กทรอนิกส์', '1');
INSERT INTO `department` VALUES ('54', 'อิเล็กทรอนิกส์อุตสาหกรรม', 'อิเล็กทรอนิกส์อุตสาหกรรม', '1');
INSERT INTO `department` VALUES ('55', 'เครื่องทำความเย็นและปรับอากาศ', 'เครื่องทำความเย็นและปรับอากาศ', '1');
INSERT INTO `department` VALUES ('56', 'เครื่องมือกล', 'เครื่องมือกล', '1');
INSERT INTO `department` VALUES ('57', 'เทคนิคการจัดการพลังงาน', 'เทคนิคการจัดการพลังงาน', '1');
INSERT INTO `department` VALUES ('58', 'เทคนิคยานยนต์', 'เทคนิคยานยนต์', '1');
INSERT INTO `department` VALUES ('59', 'เทคนิคสถาปัตยกรรม', 'เทคนิคสถาปัตยกรรม', '1');
INSERT INTO `department` VALUES ('60', 'เทคโนโลยีงานเชื่อมโครงสร้างโลหะ', 'เทคโนโลยีงานเชื่อมโครงสร้างโลหะ', '1');
INSERT INTO `department` VALUES ('61', 'เทคโนโลยียานยนต์', 'เทคโนโลยียานยนต์', '1');
INSERT INTO `department` VALUES ('62', 'เทคโนโลยีสารสนเทศ', 'เทคโนโลยีสารสนเทศ', '1');
INSERT INTO `department` VALUES ('63', 'เทคโนโลยีอิเล็กทรอนิกส์', 'เทคโนโลยีอิเล็กทรอนิกส์', '1');
INSERT INTO `department` VALUES ('64', 'เทคโนโลยีแม่พิมพ์', 'เทคโนโลยีแม่พิมพ์', '1');
INSERT INTO `department` VALUES ('65', 'เทคโนโลยีไฟฟ้า', 'เทคโนโลยีไฟฟ้า', '1');
INSERT INTO `department` VALUES ('66', 'โครงสร้าง', 'โครงสร้าง', '1');
INSERT INTO `department` VALUES ('67', 'โยธา', 'โยธา', '1');
INSERT INTO `department` VALUES ('68', 'ไฟฟ้ากำลัง', 'ไฟฟ้ากำลัง', '1');

-- ----------------------------
-- Table structure for `person`
-- ----------------------------
DROP TABLE IF EXISTS `person`;
CREATE TABLE `person` (
  `p_id` int(5) NOT NULL AUTO_INCREMENT,
  `person_idcard` char(13) COLLATE utf8_unicode_ci NOT NULL,
  `username` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `pre_code` char(50) COLLATE utf8_unicode_ci NOT NULL,
  `name` varchar(35) COLLATE utf8_unicode_ci NOT NULL,
  `surname` varchar(35) COLLATE utf8_unicode_ci NOT NULL,
  `age` date NOT NULL,
  `groupuser_id` char(2) COLLATE utf8_unicode_ci NOT NULL,
  `sitid` char(6) COLLATE utf8_unicode_ci NOT NULL,
  `userstatus` varchar(2) COLLATE utf8_unicode_ci DEFAULT NULL,
  `empno` varchar(2) COLLATE utf8_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`p_id`),
  KEY `sitid` (`sitid`)
) ENGINE=MyISAM AUTO_INCREMENT=489434 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of person
-- ----------------------------
INSERT INTO `person` VALUES ('1', '1552125125432', 'admin', '123456!', 'นาย', 'ผู้ดูแลระบบ', 'ผู้ดูแลระบบ', '1988-03-16', '9', '2', '11', '1');
INSERT INTO `person` VALUES ('2', '6543211111111', '5051007', '654321', 'นาย', 'อลงกรณ์ ', 'ภูคงคา', '0000-00-00', '2', '2', '11', '2');
INSERT INTO `person` VALUES ('4999', '3032008', '3032008', '654321', '', 'นายกฤษณชนม์  คำศรีสุข', '', '0000-00-00', '2', '', '11', '19');
INSERT INTO `person` VALUES ('5', '1234567890112', 'msomkid5', '123456', 'นาย', 'สมคิด', 'มีมะจำ', '1994-02-15', '8', '2', '11', '0');
INSERT INTO `person` VALUES ('4998', '2011002', '2011002', '654321', '', 'นายวินัย  จันทร์ขามป้อม', '', '0000-00-00', '2', '', '11', '19');
INSERT INTO `person` VALUES ('4997', '2011014', '2011014', '654321', '', 'นายพิทักษ์  รวมขุนทด', '', '0000-00-00', '2', '', '11', '13');
INSERT INTO `person` VALUES ('4996', '2011013', '2011013', '654321', '', 'นายกิตติพงศ์  ยืดยาว', '', '0000-00-00', '2', '', '11', '13');
INSERT INTO `person` VALUES ('4995', '6062006', '6062006', '654321', '', 'นายจักรพันธ์  ประสพเงิน', '', '0000-00-00', '2', '', '11', '13');
INSERT INTO `person` VALUES ('4994', '6062005', '6062005', '654321', '', 'นางสุจิตราภรณ์  ศรีสวัสดิ์', '', '0000-00-00', '2', '', '11', '13');
INSERT INTO `person` VALUES ('4993', '0001006', '0001006', '654321', '', 'นายปรีชา  อารีวงษ์', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('4992', '3331004', '3331004', 'thai2523', '', 'นายอุทัย  คตภูธร', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('4991', '8084003', '8084003', '654321', '', 'นางสารภี  แต่งผิว', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('4990', '8081011', '8081011', '654321', '', 'นางสาวนิภาวรรณ  ภูศรีจัน', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('4989', '8084002', '8084002', '0883502900', '', 'นายปิยะ  วันทาแท่น', '', '0000-00-00', '2', '', '11', '5');
INSERT INTO `person` VALUES ('4988', '8081010', '8081010', '654321', '', 'นางสาวชลลดา  จันทรแดง', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('4987', '5052003', '5052003', '654321', '', 'นายจุลศักดิ์  ศิริโชติ', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('4986', '6062003', '6062003', '654321', '', 'นายชยางกูร  ไชยกิตติ', '', '0000-00-00', '2', '', '11', '4');
INSERT INTO `person` VALUES ('489412', '2011012', '2011012', '654321', '', 'นายสมชาย  เจริญผล', '', '0000-00-00', '2', '', '11', '32');
INSERT INTO `person` VALUES ('4984', '0002016', '0002016', '141107', '', 'นางสาวสร้อยสุดา  โพธิ์ชัยภูมิ', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('4983', '0002009', '0002009', '271033', '', 'นางสาวลลิตา  ทัพธานี', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('4982', '8083001', '8083001', '654321', '', 'นางเจียมจิตต์  โพธิ์ถิรเลิศ', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('4981', '8084009', '8084009', '66543211', '', 'นางสาวมณีรัตน์  พระไตรยะ', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('4980', '8081009', '8081009', '654321', '', 'นางศิริพร  ปรมะ', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('6734', '1234567890987', 'Ctc0003', '654321', 'นาง', 'ประภัสสร', 'อนิลบล', '2015-02-12', '5', '1', null, null);
INSERT INTO `person` VALUES ('4978', '6063102', '6063102', '654321', '', 'นายยศวัฒน์  บุญมาปัด', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('4977', '5052004', '5052004', '654321', '', 'นายวิรุฬห์  คเชนทร์รัตนกุล', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('4976', '2011011', '2011011', '654321', '', 'นายศักดิ์สิทธิ์  บุญมาก', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('4975', '0001003', '0001003', '654321', '', 'นางเสาวภา  ดิเรกโภค', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('4974', '8081008', '8081008', '654321', '', 'นางพรปภัทร สุวรรณธร', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4973', '4041004', '4041004', '654321', '', 'นายสหชัย  วัดเมือง', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4972', '8084008', '8084008', '654321', '', 'นางสาวรำไพ  อมรเจริญกุล', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4971', '8084007', '8084007', '654321', '', 'นางสาวเสาวลักษณ์  ตันติพัฒนานนท์', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4970', '8081005', '8081005', '654321', '', 'นางนันทนา  สุวรรณเพชร', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4969', '8081004', '8081004', '654321', '', 'นางนิตยดา  ทิมจันทึก', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4968', '0002015', '0002015', '654321', '', 'นางอารีรัตน์  อารีวงษ์', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4967', '0002014', '0002014', '654321', '', 'นายไพทูรย์  สว่างตา', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4966', '3331009', '3331009', '654321', '', 'นายประเสริฐ  บรรจง', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4965', '5051014', '5051014', '654321', '', 'นายมนูญ  นาจวง', '', '0000-00-00', '2', '', '11', '10');
INSERT INTO `person` VALUES ('4964', '5052012', '5052012', '654321', '', 'นายกาญจน์  เหลืองดอกไม้', '', '0000-00-00', '2', '', '11', '99');
INSERT INTO `person` VALUES ('4963', '3331007', '3331007', '654321', '', 'นายสุชาติ  สุเพ็งคำ', '', '0000-00-00', '2', '', '11', '98');
INSERT INTO `person` VALUES ('4962', '3331010', '3331010', '654321', '', 'นายธนากร  แดงบำรุง', '', '0000-00-00', '2', '', '11', '19');
INSERT INTO `person` VALUES ('4961', '3331006', '3331006', '654321', '', 'นายจักรินทร์  ชีวะเสรีย์', '', '0000-00-00', '2', '', '11', '96');
INSERT INTO `person` VALUES ('4960', '0002013', '0002013', '654321', '', 'นายปรีชา   สิทธิสาร', '', '0000-00-00', '2', '', '11', '95');
INSERT INTO `person` VALUES ('4959', '0001008', '0001008', '654321', '', 'นางสาวิชชุฎา  คำนนท์', '', '0000-00-00', '2', '', '11', '91');
INSERT INTO `person` VALUES ('4958', '2011005', '2011005', '654321', '', 'นายนิวัฒน์  ศิริวุฒิ', '', '0000-00-00', '2', '', '11', '90');
INSERT INTO `person` VALUES ('4957', '4041005', '4041005', '654321', '', 'นายวชิรวิทย์   อินต๊ะนอน', '', '0000-00-00', '2', '', '11', '89');
INSERT INTO `person` VALUES ('4956', '3331011', '3331011', '654321', '', 'นายวีระชาติ  สมน้อย', '', '0000-00-00', '2', '', '11', '17');
INSERT INTO `person` VALUES ('4955', '6063103', '6063103', '654321', '', 'นายณรงค์ฤทธิ์  เจริญภูมิ', '', '0000-00-00', '2', '', '11', '17');
INSERT INTO `person` VALUES ('4954', '0002008', '0002008', '654321', '', 'นายยุทธพงษ์  จำปาแก้ว', '', '0000-00-00', '2', '', '11', '88');
INSERT INTO `person` VALUES ('4953', '0002010', '0002010', '654321', '', 'นางสาวสุพัตรา  ศรีสะวัน', '', '0000-00-00', '2', '', '11', '87');
INSERT INTO `person` VALUES ('4952', '0002011', '0002011', '654321', '', 'นายวิทยา  ปัตตาเทสัง', '', '0000-00-00', '2', '', '11', '86');
INSERT INTO `person` VALUES ('4951', '0002012', '0002012', '654321', '', 'นางสาวณัฐฐาพร   นันทรัตน์', '', '0000-00-00', '2', '', '11', '85');
INSERT INTO `person` VALUES ('4950', '0002006', '0002006', '654321', '', 'นายสุขสันต์  หงษ์โพธิ์', '', '0000-00-00', '2', '', '11', '84');
INSERT INTO `person` VALUES ('4949', '0002005', '0002005', '654321', '', 'นางนิติดา  นิมิตรบรรณสาร', '', '0000-00-00', '2', '', '11', '83');
INSERT INTO `person` VALUES ('4948', '0002007', '0002007', '654321', '', 'นายคมกริช  กันทำ', '', '0000-00-00', '2', '', '11', '82');
INSERT INTO `person` VALUES ('4947', '0001005', '0001005', '654321', '', 'นางสาวรุ่งราตรี  พรหมสิริบูรณ์', '', '0000-00-00', '2', '', '11', '81');
INSERT INTO `person` VALUES ('4946', '0001007', '0001007', '654321', '', 'นายวัลลภ  บุญมาก', '', '0000-00-00', '2', '', '11', '80');
INSERT INTO `person` VALUES ('4945', '7071002', '7071002', '654321', '', 'นางสาวณัฐวรัญช์  ศรีเทศ', '', '0000-00-00', '2', '', '11', '79');
INSERT INTO `person` VALUES ('4944', '5052010', '5052010', '445675', '', 'นายอภิรักษ์  รักษากุล', '', '0000-00-00', '2', '', '11', '78');
INSERT INTO `person` VALUES ('4943', '5052013', '5052013', '654321', '', 'นายศราวุธ  ดีแสง', '', '0000-00-00', '2', '', '11', '77');
INSERT INTO `person` VALUES ('4942', '5052011', '5052011', '654321', '', 'นายเกียรติศักดิ์  บุรีจันทร์', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('4941', '8083002', '8083002', '654321', '', 'นางสุภัชชา  นาคสระเกษ', '', '0000-00-00', '2', '', '11', '75');
INSERT INTO `person` VALUES ('4940', '8082003', '8082003', '654321', '', 'นางสาวปทุมพร  ประสาร', '', '0000-00-00', '2', '', '11', '74');
INSERT INTO `person` VALUES ('4939', '8082002', '8082002', '654321', '', 'นางสาวนงค์นุช  สีสะใบ', '', '0000-00-00', '2', '', '11', '73');
INSERT INTO `person` VALUES ('4938', '8084005', '8084005', '654321', '', 'นายยอดเยี่ยม  เหล่านนท์ชัย', '', '0000-00-00', '2', '', '11', '72');
INSERT INTO `person` VALUES ('4937', '8084006', '8084006', '654321', '', 'นายพูนศักดิ์  ศรีดี', '', '0000-00-00', '2', '', '11', '70');
INSERT INTO `person` VALUES ('4936', '8081007', '8081007', '654321', '', 'นางดอกแก้ว  ลีโนนอด', '', '0000-00-00', '2', '', '11', '69');
INSERT INTO `person` VALUES ('4935', '8081006', '8081006', '654321', '', 'นางณัฐพร  สุวรรณชัย', '', '0000-00-00', '2', '', '11', '68');
INSERT INTO `person` VALUES ('4933', '3331003', '3331003', '654321', '', 'นายเพ็ชร  นาคดี', '', '0000-00-00', '2', '', '11', '66');
INSERT INTO `person` VALUES ('4934', '3331005', '3331005', '654321', '', 'นายศุภวุฒิ  อันสนธิ์', '', '0000-00-00', '2', '', '11', '67');
INSERT INTO `person` VALUES ('4932', '3331002', '3331002', '654321', '', 'นายบรรพต  มหาคาม', '', '0000-00-00', '2', '', '11', '65');
INSERT INTO `person` VALUES ('4931', '0002003', '0002003', '654321', '', 'นางจงรัก  ศิวกุล', '', '0000-00-00', '2', '', '11', '56');
INSERT INTO `person` VALUES ('4930', '2011008', '2011008', '654321', '', 'นายชัชชัย  จุงอินทะ', '', '0000-00-00', '2', '', '11', '64');
INSERT INTO `person` VALUES ('4929', '2011010', '2011010', '654321', '', 'นายวิธวัฒน์  สารโภค', '', '0000-00-00', '2', '', '11', '63');
INSERT INTO `person` VALUES ('4928', '2011009', '2011009', '654321', '', 'นายมนูศักดิ์  สารผล', '', '0000-00-00', '2', '', '11', '62');
INSERT INTO `person` VALUES ('4927', '5051016', '5051016', '654321', '', 'นายบุญญาฤทธิ์  บุญบำรุง', '', '0000-00-00', '2', '', '11', '61');
INSERT INTO `person` VALUES ('4926', '5051015', '5051015', '654321', '', 'นายเสกสิทธิ์  แพชัยภูมิ', '', '0000-00-00', '2', '', '11', '60');
INSERT INTO `person` VALUES ('4925', '0001004', '0001004', '654321', '', 'นางรุ่งทิวา  อินทรมา', '', '0000-00-00', '2', '', '11', '59');
INSERT INTO `person` VALUES ('4924', '0001002', '0001002', '654321', '', 'นายสมพงษ์  มณีวรรณ', '', '0000-00-00', '2', '', '11', '58');
INSERT INTO `person` VALUES ('4923', '0001001', '0001001', '654321', '', 'นายบัญชา  กลิ่นจันทร์แดง', '', '0000-00-00', '2', '', '11', '57');
INSERT INTO `person` VALUES ('4922', '0002004', '0002004', '654321', '', 'นางอุบลรัตน์  ผลสนอง', '', '0000-00-00', '2', '', '11', '55');
INSERT INTO `person` VALUES ('4921', '0002002', '0002002', '654321', '', 'นางสรีระ  โยธาสมบัติ', '', '0000-00-00', '2', '', '11', '54');
INSERT INTO `person` VALUES ('4920', '8083003', '8083003', '654321', '', 'นางณิชมนย์  ตรงจันทึก', '', '0000-00-00', '2', '', '11', '53');
INSERT INTO `person` VALUES ('4919', '8084001', '8084001', '654321', '', 'นางประภัสสร  อนิลบล', '', '0000-00-00', '2', '', '11', '3');
INSERT INTO `person` VALUES ('4918', '8082001', '8082001', '654321', '', 'นางพิศมัย  สุขะเกตุ', '', '0000-00-00', '2', '', '11', '52');
INSERT INTO `person` VALUES ('4917', '8081003', '8081003', '654321', '', 'นางเชื้อทิพย์  สุวรรณไพฑูรย์', '', '0000-00-00', '2', '', '11', '51');
INSERT INTO `person` VALUES ('4916', '8081002', '8081002', '654321', '', 'นางอุบลโพยม  ด้วงนิล', '', '0000-00-00', '2', '', '11', '50');
INSERT INTO `person` VALUES ('4914', '0002018', '0002018', '123456', '', 'Miss GUI Jiasul', '', '0000-00-00', '2', '', '11', '19');
INSERT INTO `person` VALUES ('4915', '8081001', '8081001', '654321', '', 'นางเรณู  ปานะสุนทร', '', '0000-00-00', '2', '', '11', '49');
INSERT INTO `person` VALUES ('4913', '5052008', '5052008', '654321', '', 'นายสุขสรรค์  พรธิอั้ว', '', '0000-00-00', '2', '', '11', '48');
INSERT INTO `person` VALUES ('4912', '5052006', '5052006', '654321', '', 'นายทิพยา  สุวรรณชัย', '', '0000-00-00', '2', '', '11', '17');
INSERT INTO `person` VALUES ('4911', '5052009', '5052009', '654321', '', 'นางสาวปาณิศา  ทองสกุล', '', '0000-00-00', '2', '', '11', '47');
INSERT INTO `person` VALUES ('4910', '5052007', '5052007', '12345654321', '', 'นายประภาส  สุวรรณเพชร', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('4909', '5052005', '5052005', '654321', '', 'นายจีรปัฎน์  พุ่มศฤงฆาร', '', '0000-00-00', '2', '', '11', '45');
INSERT INTO `person` VALUES ('4908', '5052001', '5052001', '654321', '', 'นายสุพิน  ปานะสุนทร', '', '0000-00-00', '2', '', '11', '44');
INSERT INTO `person` VALUES ('4907', '5051013', '5051013', '654321', '', 'นายกิตติพร  ทองขัติ', '', '0000-00-00', '2', '', '11', '43');
INSERT INTO `person` VALUES ('4906', '5051006', '5051006', '654321', '', 'นายธนกฤต  คเชนทร์รัตนกุล', '', '0000-00-00', '2', '', '11', '42');
INSERT INTO `person` VALUES ('4905', '5051012', '5051012', '654321', '', 'นายสยาม  โพธิ์เพ็ชร', '', '0000-00-00', '2', '', '11', '41');
INSERT INTO `person` VALUES ('4904', '5051010', '5051010', '654321', '', 'นายสมรัก  พรหมจารย์', '', '0000-00-00', '2', '', '11', '40');
INSERT INTO `person` VALUES ('4903', '5051008', '5051008', '654321', '', 'นายวัฒนา  แพงคำดี', '', '0000-00-00', '2', '', '11', '39');
INSERT INTO `person` VALUES ('4902', '5051011', '5051011', '654321', '', 'นางกรรณิกา  สีจุ้ย', '', '0000-00-00', '2', '', '11', '38');
INSERT INTO `person` VALUES ('4901', '5051005', '5051005', '654321', '', 'นายกฤษะ  ฤาชา', '', '0000-00-00', '2', '', '11', '37');
INSERT INTO `person` VALUES ('4900', '5051004', '5051004', '654321', '', 'นายภควา  อ้อทอง', '', '0000-00-00', '2', '', '11', '36');
INSERT INTO `person` VALUES ('4899', '5051007', '5051007', '654321', '', 'นายอลงกรณ์  ภูคงคา', '', '0000-00-00', '2', '', '11', '2');
INSERT INTO `person` VALUES ('4898', '5051009', '5051009', '654321', '', 'นายปัญญา  สีจุ้ย', '', '0000-00-00', '2', '', '11', '35');
INSERT INTO `person` VALUES ('4897', '5051003', '5051003', '654321', '', 'นายสมชาย  สุขะเกตุ', '', '0000-00-00', '2', '', '11', '34');
INSERT INTO `person` VALUES ('4896', '5051001', '5051001', '654321', '', 'นายสุรพงษ์  เกลียวสีนาค', '', '0000-00-00', '2', '', '11', '33');
INSERT INTO `person` VALUES ('4895', '7071001', '7071001', '654321', '', 'นางสาวเบญจวรรณ  จันทร์ที', '', '0000-00-00', '2', '', '11', '17');
INSERT INTO `person` VALUES ('4894', '2011006', '2011006', '654321', '', 'นายบุญมี  โคตรประทุม', '', '0000-00-00', '2', '', '11', '32');
INSERT INTO `person` VALUES ('4893', '2011007', '2011007', '654321', '', 'นายคงฤทธิ์  สีชำนิ', '', '0000-00-00', '2', '', '11', '31');
INSERT INTO `person` VALUES ('4892', '2011001', '2011001', '654321', '', 'นายเสถียร  มะสุทธิ', '', '0000-00-00', '2', '', '11', '30');
INSERT INTO `person` VALUES ('4891', '2011004', '2011004', '654321', '', 'นายอาทิตย์  บุตรสุด', '', '0000-00-00', '2', '', '11', '29');
INSERT INTO `person` VALUES ('4890', '2011003', '2011003', '654321', '', 'นายธีรพงษ์   อินทรสมบัติ', '', '0000-00-00', '2', '', '11', '6');
INSERT INTO `person` VALUES ('4889', '4041003', '4041003', '654321', '', 'นายอภิสิทธิ์  ชัยนิติกุล', '', '0000-00-00', '2', '', '11', '28');
INSERT INTO `person` VALUES ('4888', '3032006', '3032006', '654321', '', 'นายยุทธนา  บรรเทิงใจ', '', '0000-00-00', '2', '', '11', '27');
INSERT INTO `person` VALUES ('4887', '3032007', '3032007', '654321', '', 'นายอดิศร  สิทธิวงศ์', '', '0000-00-00', '2', '', '11', '26');
INSERT INTO `person` VALUES ('4886', '3032005', '3032005', '654321', '', 'นายอภิสิทธิ์  ชัยนิติกุล', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('4885', '3032001', '3032001', '654321', '', 'นายเจริญ  กฤษกลาง', '', '0000-00-00', '2', '', '11', '24');
INSERT INTO `person` VALUES ('4884', '3032004', '3032004', '654321', '', 'นายสุระ  นิระวรรณ', '', '0000-00-00', '2', '', '11', '23');
INSERT INTO `person` VALUES ('4883', '3032002', '3032002', '654321', '', 'นายชาญศักดิ์  จำรัสจันทร์', '', '0000-00-00', '2', '', '11', '22');
INSERT INTO `person` VALUES ('4882', '3032003', '3032003', '654321', '', 'นายสุคต  แจ่มกลาง', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('4881', '6062001', '6062001', '654321', '', 'นายสุวัฒน์  อุตมะพันธุ์', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('4880', '6062002', '6062002', '654321', '', 'ว่าที่ ร.ต.แสวง  ไชยบาล', '', '0000-00-00', '2', '', '11', '19');
INSERT INTO `person` VALUES ('489420', '3032009', '3032009', '654321', '', 'นางสาวรัญญา  ชื่นเมือง', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('4879', '6061002', '6061002', '654321', '', 'นายฉลอง  ม่วงทิพย์', '', '0000-00-00', '2', '', '11', '18');
INSERT INTO `person` VALUES ('4878', '6061003', '6061003', '654321', '', 'นางสมหมาย  คำหงษา', '', '0000-00-00', '2', '', '11', '17');
INSERT INTO `person` VALUES ('4877', '5051002', '5051002', '26322632', '', 'นายดุสิต  สูรย์ราช', '', '0000-00-00', '2', '', '11', '7');
INSERT INTO `person` VALUES ('4876', '4041001', '4041001', '654321', '', 'นายวัชรินทร์  โตนชัยภูมิ', '', '0000-00-00', '2', '', '11', '16');
INSERT INTO `person` VALUES ('4875', '6063101', '6063101', '654321', '', 'นายสกนธ์  หมั่นกิจ', '', '0000-00-00', '2', '', '11', '8');
INSERT INTO `person` VALUES ('4868', '2222222222222', 'mon2', '123456', 'นางสาว', 'อมรรัตน์', 'เพ็ชรกำเนิด', '2013-12-18', '6', '1', '11', null);
INSERT INTO `person` VALUES ('4870', '6061001', '6061001', '654321', '', 'นายชัยรัตน์  สุตภักดี', '', '0000-00-00', '2', '', '11', '9');
INSERT INTO `person` VALUES ('4871', '3331001', '3331001', '654321', '', 'นายประดิษฐ์  บุญมี', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('4872', '4041002', '4041002', '654321', '', 'นายสุพี  ทิมจันทึก', '', '0000-00-00', '2', '', '11', '13');
INSERT INTO `person` VALUES ('4873', '0002001', '0002001', '0857716961', '', 'นางสาวบุษบารัตน์  ละสามา', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('4874', '5052002', '5052002', '654321', '', 'นายธวัชชัย  สุนประสพ', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('4867', '1236547896321', '0002010', '654321', 'นางสาว', 'สุพัตรา', 'ศรีสะวัน', '2003-12-02', '2', '3', '11', '87');
INSERT INTO `person` VALUES ('4866', '1111111000000', 'mon1', '123456', 'นาย', 'อลงกรณ์', 'ภูคงคา', '2013-12-16', '3', '1', '11', null);
INSERT INTO `person` VALUES ('5000', '5051017', '5051017', '654321', '', 'นายไพบูลย์  ตั้งจรูญถาวร', '', '0000-00-00', '2', '', '11', '13');
INSERT INTO `person` VALUES ('5001', '8084004', '8084004', '654321', '', 'นายปรีชา  ปรือปรัง', '', '0000-00-00', '2', '', '11', '14');
INSERT INTO `person` VALUES ('5002', '0002019', '0002019', '123456', '', 'Mr. Divine Toh kom', '', '0000-00-00', '2', '', '11', '18');
INSERT INTO `person` VALUES ('5003', '2011015', '2011015', '654321', '', 'นายอนุชา คำนนอินทร์', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('5004', '5051018', '5051018', '654321', '', 'นายโกวิท  พันธุ์ทอง', '', '0000-00-00', '2', '', '11', '18');
INSERT INTO `person` VALUES ('5005', '0002020', '0002020', '123456', '', 'Mr.Glen  H.Weyer  II', '', '0000-00-00', '2', '', '11', '18');
INSERT INTO `person` VALUES ('5006', '7071003', '7071003', '654321', '', 'นางสาวกฤษณา  แนววิเศษ', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('5007', '0002017', '0002017', '123456', '', 'นางเข็มพร  ทันสมัย', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('5008', '6062007', '6062007', '654321', '', 'นายอนุรักษ์  หม่องนัน', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('5009', '6062008', '6062008', '654321', '', 'นายดนุพล  ทาบุญ', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('5010', 'admin', 'admin', '654321', '', 'ผู้ดูแลระบบ', '', '0000-00-00', '2', '', '11', '1');
INSERT INTO `person` VALUES ('5011', '5052014_14', '5052014_14', '654321', '', 'นางชุติญา  อัยยะ', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('5012', '2011016', '2011016', '654321', '', 'นายไกรภูมิ  คำนาค', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('5013', '0002021', '0002021', '654321', '', 'นางสาวเณตรนรินทร์   ชื่นใส', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('5014', '2011017', '2011017', '654321', '', 'นายเฉลิมวุฒิ  อาจกมล', '', '0000-00-00', '2', '', '11', '71');
INSERT INTO `person` VALUES ('5015', '6063104', '6063104', '654321', '', 'นายสุริยา  พลทะยาน', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('5016', '8084010', '8084010', '654321', '', 'นางสาวมณีรัตน์  ประดับค่าย', '', '0000-00-00', '2', '', '11', '14');
INSERT INTO `person` VALUES ('5017', '8084011', '8084011', '654321', '', 'นางนันท์นภัส  คำวชิรพิทักษ์', '', '0000-00-00', '2', '', '11', '');
INSERT INTO `person` VALUES ('5018', '3331012', '3331012', '654321', '', 'นายอภิโชค  พรหมจันทร์', '', '0000-00-00', '2', '', '11', '22');
INSERT INTO `person` VALUES ('5020', '0002022', '0002022', '654321', '', 'นายอนุศาสน์   ปาทา', '', '0000-00-00', '2', '', '11', '22');
INSERT INTO `person` VALUES ('5021', '0002023', '0002023', '654321', '', 'Mrs.Edela Mojoko Eko Molua', '', '0000-00-00', '2', '', '11', '22');
INSERT INTO `person` VALUES ('5022', '0002024', '0002024', '123456', '', 'Mr.Mathew  Williams', '', '0000-00-00', '2', '', '11', '22');
INSERT INTO `person` VALUES ('489419', '4041006', '4041006', '654321', '', 'นายศุภกฤต  จัตุเรศ', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('489418', '0001009', '0001009', '654321', '', 'นางพิมพาพร  กลิ่นจันทร์แดง', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('5025', '1111222222222', '15428a', '123456', 'นาย', 'สยาม', 'โพธิเพ็ชร', '2014-02-05', '6', '1', '11', null);
INSERT INTO `person` VALUES ('5027', '3331014', '3331014', '654321', '', 'นายชาตรี  ป้องยาง', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('489417', '0001008', '0001008', '654321', '', 'นายณัฐวัฒน์  เข็มตรง', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('5029', '2222222222222', 'mon3', '123456', 'นางสาว', 'อมรรัตน์', 'เพรชกำเนิด', '2014-08-06', '8', '1', '11', null);
INSERT INTO `person` VALUES ('5030', '3331013', '3331013', '654321', '', 'นายสุคต  แจ่มกลาง', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('5031', '7071004', '7071004', '654321', '', 'นายอลงกรณ์  ภูคงคา', '', '0000-00-00', '2', '', '1', '2');
INSERT INTO `person` VALUES ('6735', '1234567890987', 'Ctc0008', '654321', 'นางสาว', 'รัชณี', 'ผลานิสงค์', '1992-02-28', '3', '3', null, null);
INSERT INTO `person` VALUES ('6736', '1234567890987', 'Ctc0009', '654321', 'นาย', 'รัชภูมิ', 'คุ้มบุ่งคล้า', '2015-02-12', '6', '1', null, null);
INSERT INTO `person` VALUES ('6733', '1234567890987', 'Ctc0001', '654321', 'นาย', 'สมผัด', 'อินทรมา', '0000-00-00', '5', '3', null, null);
INSERT INTO `person` VALUES ('489416', '0002031', '0002031', '212524', '', 'นางอารีรัตน์  อารีวงษ์', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('6726', '1111111111222', 'ctc0001', '123456', 'นาย', 'อลงกรณ์', 'ภูคงคา', '2015-01-16', '5', '1', null, null);
INSERT INTO `person` VALUES ('6727', '1234567891234', 'ctc0002', '123456', 'นาย', 'วันชัย', 'ชำนาญศรี', '1958-01-23', '5', '3', null, null);
INSERT INTO `person` VALUES ('6728', '1234567894567', 'ctc0003', '123456', 'นาย', 'เอกสิทธิ์', 'ปรมะ', '1966-01-23', '5', '3', null, null);
INSERT INTO `person` VALUES ('6729', '1234567897899', 'ctc0004', '123456', 'นาย', 'คีรินทร์', 'อนุตตรังกูร', '1960-01-23', '5', '3', null, null);
INSERT INTO `person` VALUES ('6730', '3216549873654', 'ctc0005', '123456', 'นาง', 'ประภัสสร', 'อนิลบล', '1966-01-23', '5', '3', null, null);
INSERT INTO `person` VALUES ('6731', '1234567891236', 'ctc0006', '123456789', 'นางสาว', 'รำไพ', 'อมรเจริญกุล', '1956-12-21', '3', '3', null, null);
INSERT INTO `person` VALUES ('6740', '', '0002025', '654321', 'Ms.', 'Hu Jie', 'Hu Jie', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('6741', '', '2011020', '654321', '', 'นายศรรตยา  พิณพาทย์', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('6742', '', '2011018', '654321', '', 'นายวสันต์  สมวงษ์สา', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('6743', '', '2011019', '654321', '', 'นายณัฐชัย  พั้วสุ', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('6744', '', '0002027', '654321', '', 'อ.พัชรี  ภูสีอ่อน', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('6745', '', '0002028', '654321', '', 'นายพุฒธิศักดิ์  อุดมเศรษฎ์', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('6746', '', '0002026', '654321', '', 'Ms.Liu Meng Jun', '', '0000-00-00', '2', '', '11', null);
INSERT INTO `person` VALUES ('6749', '2011021', '2011021', '654321', '', 'นายธีรศักดิ์  สาวะถี', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('489415', '0002030', '0002030', '654321', '', 'นางปัณฑิกา  ไชยกิตติ', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('6750', '2011022', '2011022', '654321', '', 'นายณัฐวุฒิ  ดื่มโชค', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('6751', '2011023', '2011023', '654321', '', 'นายภัทรพล  ระโยธี', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('6752', '3331015', '3331015', '654321', '', 'นายฉัตรมงคล  มาตรเมือง', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('6753', '8084012', '8084012', '654321', '', 'นางตุ๊กตา  นารีรักษ์', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('6754', '8084013', '8084013', '654321', '', 'นายกฤตเมธ  เกิดบ้านเป้า', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('6755', '5051019', '5051019', '654321', '', 'นายอนันท์  รักษาวัง', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('6756', '5051020', '5051020', '654321', '', 'นายณฐปกรณ์  อิ่มเหว่า', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('6757', '5051021', '5051021', '654321', '', 'นายจักรพันธุ์  ทองจำรูญ', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('6758', '0002029', '0002029', '654321', '', 'Mr.Brian  J.Harrison', '', '0000-00-00', '2', '', '11', '21');
INSERT INTO `person` VALUES ('489414', '3331016', '3331016', '654321', '', 'นายสุพล  หาญชนะ', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('489421', '5052014', '5052014', '654321', '', 'นายณัฐดนัย  ชมภูพาน', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('489422', '5052015', '5052015', '654321', '', 'นายวัชราวุธ  สอนชัยภูมิ', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('489423', '7071005', '7071005', '654321', '', 'นายเจษฎา  มาประเสริฐ', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('489424', '0002032', '0002032', '654321', '', 'Mr.Bishnu Rai', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('489425', '0002033', 'Mr.Namgay  Wangdi', '654321', '', 'นางอารีรัตน์  อารีวงษ์', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('14873', '0002033', '0002033', '654321', '', 'Mr.Namgay  Wangdi', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('489426', '1234567890', '9009', '123456', 'งานกิจกรรม', 'งานกิจกรรม', '', '0000-00-00', '2', '', null, null);
INSERT INTO `person` VALUES ('6759', '5051022', '5051022', '654321', '', 'นางสาวกมลทิพย์  วรพล', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('6760', '5051023', '5051023', '654321', '', 'นายสุรพงศ์  พรมชีลอง', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('6761', '5051024', '5051024', '654321', '', 'นายนคร  ยืนนาน', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('6762', '6063105', '6063105', '654321', '', 'นายวันชัย  ชำนาญศรี', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('6763', '8082004', '8082004', '654321', '', 'นางสาวจารุณี  คบสหาย', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('489427', '6063107', '6063107', '654321', '', 'นายเจษฎา  จิตแสง', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('489428', '3331008', '3331008', '654321', '', 'นายโชคชัย  มูลกว้าง', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('489429', '0001010', '0001010', '654321', '', 'นายมงคล  ภูสิลิต', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('489430', '8082005', '8082005', '654321', '', 'นายรัชภูมิ  คุ้มบุ่งคล้า', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('489431', '6061004', '6061004', '654321', '', 'นางใจแก้ว  ศิริโชติ', '', '0000-00-00', '2', '', '11', '20');
INSERT INTO `person` VALUES ('489432', '3032010', '3032010', '654321', '', 'นายกฤษดา  อภัยนอก', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('489433', '6063107', '6063107', '654321', '', 'นายเจษฎา  จิตแสง', '', '0000-00-00', '2', '', '11', '11');
INSERT INTO `person` VALUES ('6764', '3331017', '3331017', '654321', '', 'นายชัยชนะ  ชิระบุตร', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('6765', '5051025', '5051025', '654321', '', 'นายนภัทร  จงใจภักดิ์', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('6766', '5051026', '5051026', '654321', '', 'นายณัฐวัฒน์  ชูศรี', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('6767', '6063106', '6063106', '654321', '', 'นางสาวพัชรี   ศรีน้อย', '', '0000-00-00', '2', '', '11', '12');
INSERT INTO `person` VALUES ('6768', '6061005', '6061005', '654321', '', 'นางสาวนุชรี   ตามบุญ', '', '0000-00-00', '2', '', '11', '12');

-- ----------------------------
-- Table structure for `teacher`
-- ----------------------------
DROP TABLE IF EXISTS `teacher`;
CREATE TABLE `teacher` (
  `teacher_id` bigint(3) unsigned NOT NULL AUTO_INCREMENT,
  `teacher_code` varchar(30) NOT NULL DEFAULT '',
  `teacher_name` varchar(60) DEFAULT NULL,
  `teacher_posi` varchar(50) DEFAULT NULL,
  `teacher_posi1` varchar(20) DEFAULT NULL,
  `teacher_posi2` varchar(30) DEFAULT NULL,
  `teacher_posi3` varchar(30) DEFAULT NULL,
  `teacher_dep` varchar(50) DEFAULT NULL,
  `teacher_tel` varchar(12) DEFAULT NULL,
  `teacher_bri` varchar(14) DEFAULT NULL,
  `std_gro1` varchar(10) DEFAULT NULL,
  `std_gro2` varchar(10) DEFAULT NULL,
  `std_gro3` varchar(10) DEFAULT NULL,
  `d_code` varchar(100) DEFAULT NULL,
  `std_gro4` varchar(10) DEFAULT NULL,
  PRIMARY KEY (`teacher_id`)
) ENGINE=MyISAM AUTO_INCREMENT=268 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of teacher
-- ----------------------------
INSERT INTO `teacher` VALUES ('1', '6061001', 'นายชัยรัตน์  สุตภักดี', 'คอ.บ.วิศวกรรมโยธา', 'ครู  คศ.2', 'ปริญญาโท', '', 'ช่างก่อสร้าง', '0818784216', null, '61310601', '61310605', '60310601', '6061', '60310605');
INSERT INTO `teacher` VALUES ('2', '3331001', 'นายประดิษฐ์  บุญมี', 'ปวส. ปม.ช่างกลโรงงาน', 'ครู  คศ.2', 'ต่ำกว่าปริญญาตรี', '', 'ช่างกลโรงงาน', '0870208032', null, '60310207', '0', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('3', '4041002', 'นายสุพี  ทิมจันทึก', 'คศ.บ.บริหารการศึกษา', 'ครู  คศ.3', 'ปริญญาตรี', '', 'เทคนิคพื้นฐาน', '0812827323', null, '59210201', '59210202', '0', '4041', '0');
INSERT INTO `teacher` VALUES ('4', '0002001', 'นางสาวบุษบารัตน์  ละสามา', 'กศ.บ.(คณิตศาสตร์)', 'ครู  คศ.2', 'ปริญญาตรี', null, 'สัมพันธ์', '0892835473', null, '59210502', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('5', '5052002', 'นายกมลาสน์  คำวชิรพิทักษ์', '', 'ครู ', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', '0810655142', null, '0', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('6', '6063101', 'นายสกนธ์  หมั่นกิจ', 'ค.อ.บ.(โยธา)', 'ครู  คศ.3', 'ปริญญาตรี', '6063', 'ช่างโยธา', '0819774280', null, '60312101', '60312105', '60312106', '6063', '0');
INSERT INTO `teacher` VALUES ('7', '4041001', 'นายวัชรินทร์  โตนชัยภูมิ', 'คอ.บ.วิศวกรรมเครื่องกล', 'ครู  คศ.2', 'ปริญญาตรี', '', 'เทคนิคพื้นฐาน', '0813892111', null, '0', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('8', '5051002', 'นายดุสิต  สูรย์ราช', '-', 'ครู  คศ.3', 'ปริญญาโท', null, 'ไฟฟ้ากำลัง', '0818768459', null, '61410401', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('9', '6061003', 'นางสมหมาย  คำหงษา', 'ปทส.ก่อสร้าง', 'ครู  คศ.1', 'ปริญญาตรี', '', 'ช่างก่อสร้าง', '0887117748', null, '57210601', '0', '0', '6061', '0');
INSERT INTO `teacher` VALUES ('10', '6061002', 'นายฉลอง  ม่วงทิพย์', 'ค.อ.บ.วิศวกรรมโยธา', 'ครู  คศ.2', 'ปริญญาตรี', '6061', 'ช่างก่อสร้าง', '0833653323', null, '61210601', '60210601', '0', '6061', '0');
INSERT INTO `teacher` VALUES ('11', '6062002', 'ว่าที่ ร.ต.แสวง  ไชยบาล', 'วศ.บ.เทคโนโลยีอุตสาหกรรม', 'ครู  คศ.2', 'ปริญญาตรี', '', 'สถาปัตยกรรม', '0831253984', null, '60210801', '0', '0', '6062', '0');
INSERT INTO `teacher` VALUES ('12', '6062001', 'นายสุวัฒน์  อุตมะพันธุ์', 'ค.อ.ม.เทคโนโลยีผลิตภัณฑ์อุตสาหกรรม', 'ครู  คศ.3', 'ปริญญาโท', '6062', 'สถาปัตยกรรม', '0818786519', null, '60310801', '60310805', '0', '6062', '0');
INSERT INTO `teacher` VALUES ('13', '3331013', 'นายสุคต  แจ่มกลาง', 'ค.อ.บ.วิศวกรรมเครื่องกล', 'ครู  คศ.3', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '0896267901', null, '60310203', '0', '0', '3032', '0');
INSERT INTO `teacher` VALUES ('14', '3032002', 'นายชาญศักดิ์  จำรัสจันทร์', 'คบ.อุตสาหกรรมศิลป์', 'ครู  คศ.2', 'ปริญญาตรี', null, 'ช่างเชื่อมโลหะการ', '0872824743', null, '0', '0', '0', '3032', '0');
INSERT INTO `teacher` VALUES ('15', '3032004', 'นายสุระ  นิระวรรณ', 'ค.อ.บ.วิศวกรรมอุตสาหกรรม', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ช่างเชื่อมโลหะการ', '0817092409', null, '60310305', '0', '0', '3032', '0');
INSERT INTO `teacher` VALUES ('16', '3032001', 'นายเจริญ  กฤษกลาง', 'ค.อ.ม.วิศวกรรมเครื่องกล', 'ครู  คศ.2', 'ปริญญาโท', '', 'ช่างเชื่อมโลหะการ', '0819670043', null, '0', '0', '0', '3032', '0');
INSERT INTO `teacher` VALUES ('17', '3032005', 'นายอภิสิทธิ์  ชัยนิติกุล', 'ค.อ.บ.วิศวกรรมเครื่องกล', 'ครู  คศ.3', 'ปริญญาตรี', '', 'ช่างเชื่อมโลหะการ', '0872608170', null, '57210301', '0', '0', '3032', '0');
INSERT INTO `teacher` VALUES ('18', '3032007', 'นายอดิศร  สิทธิวงศ์', 'คอ.ม.เทคโนโลยีสารสื่อสารการศึกษา', 'ครู  คศ.2', 'ปริญญาโท', '', 'ช่างเชื่อมโลหะการ', '0854149795', null, '0', '0', '0', '3032', '0');
INSERT INTO `teacher` VALUES ('19', '3032006', 'นายยุทธนา  บรรเทิงใจ', 'คบ.อุตสาหกรรมศิลป์', 'ครู  คศ.2', 'ปริญญาตรี', '3032', 'ช่างเชื่อมโลหะการ', '0815937960', null, '61310305', '61410201', '0', '3032', '0');
INSERT INTO `teacher` VALUES ('20', '4041003', 'นายอภิสิทธิ์  ชัยนิติกุล', 'ศษ.บ.เอกประถม', 'ครู  คศ.3', 'ปริญญาตรี', '', 'เทคนิคพื้นฐาน', '0868741055', null, '60210203', '60210204', '0', '4041', '0');
INSERT INTO `teacher` VALUES ('21', '2011003', 'นายธีรพงษ์   อินทรสมบัติ', '-', 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างยนต์', '-', null, '60210110', '0', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('22', '2011004', 'นายอาทิตย์  บุตรสุด', '-', 'ครู  คศ.1', 'ปริญญาตรี', null, 'ช่างยนต์', '0819990977', null, '61210107', '61210108', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('23', '2011001', 'นายเสถียร  มะสุทธิ', 'ค.อ.บ.วิศวกรรมเครื่องกล', 'ครู  คศ.3', 'ปริญญาตรี', '2011', 'ช่างยนต์', '0818765165', null, '60310101', '0', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('24', '2011007', 'นายคงฤทธิ์  สีชำนิ', '-', 'ครู  คศ.1', 'ปริญญาตรี', '', 'ช่างยนต์', '0818762951', null, '61310102', '60410101', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('25', '2011006', 'นายบุญมี  โคตรประทุม', '-', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ช่างยนต์', '0868700706', null, '61210101', '61210102', '61410101', '2011', '0');
INSERT INTO `teacher` VALUES ('144', '7071001', 'นายกัมปนาท  หวะสุวรรณ', null, 'ครูประจำ', 'ปริญญาตรี', '', 'เทคโนโลยีสารสนเทศ', null, null, '61390101', '61390105', '0', '7071', '0');
INSERT INTO `teacher` VALUES ('26', '5051001', 'นายสุรพงษ์  เกลียวสีนาค', '-', 'ครู  คศ.3', 'ปริญญาโท', '', 'ไฟฟ้ากำลัง', '0862566161', null, '61210405', '59210407', '0', '', '0');
INSERT INTO `teacher` VALUES ('27', '5051003', 'นายสมชาย  สุขะเกตุ', '-', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0899460613', null, '0', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('28', '5051009', 'นายปัญญา  สีจุ้ย', '-', 'ครู  คศ.2', 'ปริญญาโท', '', 'ไฟฟ้ากำลัง', '0896272112', null, '57210403', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('29', '5051007', 'นายอลงกรณ์  ภูคงคา', 'คอม.คอมพิวเตอร์และเทคโนโลยีสารสนเทศ', 'ครู  คศ.2', 'ปริญญาโท', '', 'ไฟฟ้ากำลัง', '0899321624', null, '0', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('30', '5051004', 'นายภควา  อ้อทอง', '-', 'ครู  คศ.1', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0819970173', null, '61310405', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('31', '5051005', 'นายกฤษะ  ฤาชา', '-', 'ครูอัตราจ้าง', 'ปริญญาตรี', null, 'ช่างไฟฟ้ากำลัง', '0897129870', null, '61210402', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('32', '5051011', 'นางกรณิกา  สีจุ้ย', '-', 'ครู  คศ.2', 'ปริญญาโท', '', 'ไฟฟ้ากำลัง', '0894230514', null, '61210401', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('33', '5051008', 'นายวัฒนา  แพงคำดี', 'คอ.ม.วิศวกรรมไฟฟ้า', 'ครู  คศ.2', 'ปริญญาโท', '', 'ไฟฟ้ากำลัง', '0898475354', null, '60310405', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('34', '5051010', 'นายสมรัก  พรหมจารย์', 'ค.อ.บ.ไฟฟ้ากำลัง', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0849618515', null, '61310405', '61310406', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('35', '5051012', 'นายสยาม  โพธิ์เพ็ชร', '-', 'ครู  คศ.2', 'ปริญญาตรี', '5051', 'ไฟฟ้ากำลัง', '0862559018', null, '61310409', '61310410', '60410401', '5051', '0');
INSERT INTO `teacher` VALUES ('36', '5051006', 'นายธนกฤต  คเชนทร์รัตนกุล', '-', 'ครู  คศ.1', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0817922455', null, '60210401', '60210402', '0', '', '0');
INSERT INTO `teacher` VALUES ('37', '5051013', 'นายกิตติพร  ทองขัติ', '-', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0878734979', null, '61310401', '61310402', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('38', '5052001', 'นายสุพิน  ปานะสุนทร', 'ค.อ.ม.การศึกษา', 'ครู  คศ.3', 'ปริญญาโท', '5052', 'ช่างอิเล็กทรอนิกส์', '0817893644', null, '61410501', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('39', '5052005', 'นายจีรปัฎน์  พุ่มศฤงฆาร', 'ค.อ.บ.วิศวกรรมโทรคมนาคม', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', '0819673053', null, '61310501', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('40', '5052007', 'นายประภาส  สุวรรณเพชร', 'คอ.ม.ไฟฟ้า', 'ครู  คศ.2', 'ปริญญาโท', '', 'ช่างอิเล็กทรอนิกส์', '0862578230', null, '60310501', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('41', '5052009', 'นางสาวปาณิศา  ทองสกุล', 'อุตสาหกรรมบัณฑิต  สาขาโทรคมนาคม', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', '0868029777', null, '0', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('42', '5052006', 'นายทิพยา  สุวรรณชัย', 'คอ.ม.คอมพิวเตอร์สารสนเทศ', 'ครู  คศ.2', 'ปริญญาโท', '', 'ช่างอิเล็กทรอนิกส์', '0862578230', null, '60310503', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('43', '5052008', 'นายสุขสรรค์  พรธิอั้ว', 'คอ.บ.การบริหารการศึกษา', 'ครู  คศ.3', 'ปริญญาโท', '', 'ช่างอิเล็กทรอนิกส์', '0804754910', null, '60410501', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('173', '0002018', 'Mr.Bryan K. Freeman', null, 'ครูจ้างสอนต่างชาติ', 'ครูต่างชาติ', null, 'สามัญสัมพันธ์', null, null, '0', '0', '0', '0002', null);
INSERT INTO `teacher` VALUES ('45', '8081001', 'นางเรณู  ปานะสุนทร', 'บธ.ม.บริหารธุรกิจ', 'ครู  คศ.3', 'ปริญญาโท', '8081', 'การบัญชี', '0872469422', null, '61220101', '60420101', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('46', '8081002', 'นางอุบลโพยม  ด้วงนิล', 'บธ.ม.บริหารธุรกิจ', 'ครู  คศ.2', 'ปริญญาโท', '', 'การบัญชี', '0837418605', null, '0', '0', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('47', '8081003', 'นางสาวปาริฉัตร  บุญเชิด', 'บธ.ม.บริหารธุรกิจ', '', '', '', 'การบัญชี', '0819976127', null, '61220101', '59220101', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('48', '8082001', 'นางพิศมัย  สุขะเกตุ', 'บธ.ม.บริหารธุรกิจ', 'ครู  คศ.2', 'ปริญญาโท', '8082', 'การขายการตลาด', '0862651202', null, '61320201', '61320205', '0', '8082', '0');
INSERT INTO `teacher` VALUES ('49', '8084001', 'นางประภัสสร  อนิลบล', 'คอ.ม.คอมพิวเตอร์ศึกษา', 'ครู  คศ.2', 'ปริญญาโท', '8084', 'คอมพิวเตอร์ธุรกิจ', '0896260273', null, '61320405', '61420401', '0', '8084', '0');
INSERT INTO `teacher` VALUES ('50', '8083003', 'นางณิชมนย์  ตรงจันทึก', 'บธ.บ.การจัดการทั่วไป, ปว.ค.', 'ครู  คศ.2', 'ปริญญาตรี', '', 'เลขานุการ', '0814700699', null, '59321605', '0', '0', '8083', '0');
INSERT INTO `teacher` VALUES ('51', '0002002', 'นางสรีระ  โยธาสมบัติ', 'ศษ.บ.ชีววิทยา,เคมี', 'ครู  คศ.2', 'ปริญญาตรี', null, 'สัมพันธ์', '0896273466', null, '0', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('52', '0002004', 'นางอุบลรัตน์  ผลสนอง', 'คม.หลักสูตรและการสอน', 'ครู  คศ.3', 'ปริญญาโท', '', 'สัมพันธ์', '0819669069', null, '0', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('168', '0001001', 'นายบัญชา  กลิ่นจันทร์แดง', null, 'ครู  คศ.2', 'ปริญญาตรี', null, 'สามัญ', null, null, '0', '0', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('55', '0001002', 'นายสมพงษ์  มณีวรรณ', 'กศ.บ.ภาษาไทย', 'ครู  คศ.3', 'ปริญญาตรี', '', 'สามัญ', '0898489612', null, '0', '0', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('56', '0001004', 'นางสาวอโณทัย  นาอ้น', 'ค.บ', 'ครู  คศ.1', 'ปริญญาตรี', '', 'สามัญ', '', null, '0', '0', '0', '0', '0');
INSERT INTO `teacher` VALUES ('57', '5051015', 'นายเสกสิทธิ์  แพชัยภูมิ', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0866525943', null, '59210401', '59210402', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('58', '5051016', 'นายนรินทร์  สีหะนาม', 'วิศวกรรมไฟฟ้า', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0866865235', null, '60310407', '60310408', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('59', '2011009', 'นายมนูศักดิ์  สารผล', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างยนต์', '0876765982', null, '60310102', '0', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('60', '2011010', 'นายวิธวัฒน์  สารโภค', 'วิศวกรรมศาสตร์ วิศวเครื่องกล', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างยนต์', '0812687585', null, '60310105', '60310106', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('61', '2011008', 'นายชัชชัย  จุงอินทะ', '-', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ช่างยนต์', '0844294057', null, '59210101', '59210102', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('147', '0002003', 'นางสาวจิรนันท์  โคกอ่อน', null, 'ครู  คศ.2', 'ปริญญาตรี', '', 'สัมพันธ์', null, null, '61310203', '61310204', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('62', '3331002', 'นายบรรพต  มหาคาม', 'คอ.บ.วิศวกรรมอุตสาหกรรม', 'ครู  คศ.1', 'ปริญญาตรี', '3331', 'ช่างกลโรงงาน', '', null, '61310205', '61310206', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('63', '3331003', 'นายภัทรพล พรมชัย', 'วท.บ.เทคโนโลยีอุสาหกรรม(การผลิต)', 'ครู  ', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '0862454515', null, '61310203', '61310204', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('64', '3331005', 'นายศุภวุฒิ  อันสนธิ์', 'วิศวอุตสาหกรรมบัณฑิต(สาขาเครื่องกล)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '0876927302', null, '61310207', '61310208', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('65', '8081006', 'นางณัฐพร  สุวรรณชัย', 'ศศ.บ.เศรษฐศาสตร์การเกษตร', 'ครู  คศ.1', 'ปริญญาตรี', '', 'การบัญชี', '0827507254', null, '60320101', '0', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('66', '8081007', 'นางดอกแก้ว  ลีโนนอด', 'บธ.ม.บัญชีมหาบัณฑิต', 'ครู  คศ.2', 'ปริญญาโท', '', 'การบัญชี', '0895754896', null, '60320106', '0', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('67', '8084006', 'นายพูนศักดิ์  ศรีดี', 'วิทยาศาสตร์บัณฑิตระบบสารสนเทศเพื่อการจัดการ', 'ครูจ้างสอน', 'ปริญญาตรี', null, 'คอมพิวเตอร์ธุรกิจ', '0876782754', null, '0', '0', '0', '8084', '0');
INSERT INTO `teacher` VALUES ('69', '8084005', 'นายยอดเยี่ยม  เหล่านนท์ชัย', 'วท.ม.เทคโนโลยีอินเตอร์เน็ตและสารสนเทศ', 'ครู  คศ.1', 'ปริญญาโท', '', 'คอมพิวเตอร์ธุรกิจ', '0854401991', null, '60220401', '0', '0', '8084', '0');
INSERT INTO `teacher` VALUES ('70', '8082002', 'นางสาวนงค์นุช  สีสะใบ', 'บธ.บ.การตลาด', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'การขายการตลาด', '0898473938', null, '60220201', '60320201', '60320205', '8082', '0');
INSERT INTO `teacher` VALUES ('71', '8082003', 'นางสาวปทุมพร  ประสาร', 'บธ.บ.การตลาด', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'การขายการตลาด', '0897187595', null, '61220201', '59220201', '0', '8082', '0');
INSERT INTO `teacher` VALUES ('72', '8083002', 'นางสุภัชชา  นาคสระเกษ', 'คบ.ภาษาอังกฤษ', 'ครู  คศ.2', 'ปริญญาตรี', '8083', 'เลขานุการ', '0898446476', null, '59220301', '59321605', '0', '8083', '0');
INSERT INTO `teacher` VALUES ('73', '5052011', 'นายเกียรติศักดิ์  บุรีจันทร์', '', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', '', null, '0', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('74', '5052013', 'นายศราวุธ  ดีแสง', 'สถาปัตยกรรมศาสตร์บัณฑิต', 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างอิเล็กทรอนิกส์', '-', null, '60210502', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('75', '5052010', 'นายอภิรักษ์  รักษากุล', 'วิศวกรรมศาสตร์ - วิศวกรรมไฟฟ้า', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', '0898445675', null, '0', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('76', '7071002', 'จ่าสิบเอกเอกศักดิ์  แหชัยภูมิ', 'ครุศษสตร์อุตสาหกรรมบัณฑิต สาขาคอมพิวเตอร์', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'เทคโนโลยีสารสนเทศ', '0806085870', null, '61290101', '61290102', '0', '7071', '0');
INSERT INTO `teacher` VALUES ('77', '0001007', 'นายวัลลภ  บุญมาก', 'พุทธศาสตร์บัณฑิต(สาขารัฐศาสตร์)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สามัญ', '', null, '59220103', '0', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('78', '0001005', 'นางสาวรุ่งราตรี  พรหมสิริบูรณ์', 'สังคมศาสตร์ สาขารัฐศาสตร์', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สามัญ', '', null, '59210501', '0', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('79', '0002007', 'นายคมกริช  กันทำ', 'ครุศาสตร์บัณฑิต(ภาษาอังกฤษ)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '', null, '58310505', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('80', '0002005', 'นางนิติดา  นิมิตรบรรณสาร', 'คอ.ม.การบริหารการศึกษา', 'ครู  คศ.2', 'ปริญญาโท', null, 'สัมพันธ์', '0852032074', null, '61320101', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('81', '0002006', 'นายสุขสันต์  หงษ์โพธิ์', 'ครุศาสตรบัณฑิต(ภาษาอังกฤษ)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '', null, '60310506', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('82', '0002012', 'นางสาวณัฐฐาพร   นันทรัตน์', 'วิทยาศาสตร์/ฟิสิกส์', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '0883099227', null, '61210202', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('83', '0002011', 'นายวิทยา  ปัตตาเทสัง', 'คบ.คณิตสาสตร์', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '', null, '0', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('84', '0002010', 'นางดารุณี  คุ้มคง', 'คบ.คณิตศาสตร์', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '0872419739', null, '61210207', '61210208', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('85', '0002008', 'นายยุทธพงษ์  จำปาแก้ว', 'วิทยาศาสตร์', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '', null, '60310201', '60310202', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('170', '6063103', 'นายณรงค์ฤทธิ์  เจริญภูมิ', null, 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างโยธา', null, null, '0', '0', '0', '6063', '0');
INSERT INTO `teacher` VALUES ('164', '3331011', 'นายวีระชาติ  สมน้อย', null, 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', null, null, '61210207', '61210208', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('166', '4041005', 'นายวชิรวิทย์  อินต๊ะนอน', null, 'ครูจ้างสอน', 'ปริญญาตรี', '', 'เทคนิคพื้นฐาน', null, null, '61210202', '0', '0', '4041', '0');
INSERT INTO `teacher` VALUES ('87', '2011005', 'นายนิวัฒน์  ศิริวุฒิ', 'คอ.บ. (วิศวกรรมเครื่องกล)', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ช่างยนต์', '0818768116', null, '61310101', '0', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('88', '1001008', 'นางสาวิชชุฎา  คำนนท์', 'ศึกษาศาสตร์บัณฑิต สาขาภาษาไทย', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สามัญ', '0801629129', null, '0', '0', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('89', '0002013', 'นายปรีชา  สิทธิสาร', 'วิทยาศาสตร์/ฟิสิกส์', 'คศ.1', 'ปริญญาตรี', '', 'สัมพันธ์', '', null, '60310205', '60310206', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('90', '3331006', 'นายจักรินทร์  ชีวะเสรีย์', 'ครุศาสตร์อุตสาหกรรมบัณฑิต(สาขาวิศวอุตสาหกรรม)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '0850235961', null, '60210201', '60210202', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('91', '3331010', 'นายธนากร  แดงบำรุง', 'วิศวกรรมศาสตร์เครื่องกล', 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างกลโรงงาน', '0818721124', null, '0', '0', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('92', '3331007', 'นายสุชาติ  สุเพ็งคำ', 'คอ.บ.วิศวกรรมอุตสาหการ(ออกแบบการผลิต)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '', null, '61210203', '0', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('93', '5052012', 'นายกาญจน์  เหลืองดอกไม้', 'ครุศาสตร์อุตสาหกรรมบัณฑิต สาขาวิศวกรรมอิเล็กท', 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างอิเล็กทรอนิกส์', '0854687988', null, '60210501', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('94', '5051014', 'นายมนูญ  นาจวง', '-', 'ครู  คศ.2', 'ปริญญาโท', '', 'ไฟฟ้ากำลัง', '0897096547', null, '61310407', '61310408', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('95', '3331009', 'นายประเสริฐ  บรรจง', 'อุตสาหกรรมศาสตร์บัณฑิต(สาขาเครื่องกล)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '0894245323', null, '0', '0', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('96', '0002014', 'นายไพทูรย์  สว่างตา', 'ภาษาอังกฤษ', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '0831471687', null, '0', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('97', '0002015', 'นางอารีรัตน์  อารีวงษ์', 'ครุศาสตร์บัณฑิต(ภาษาอังกฤษ)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '0881758356', null, '0', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('98', '8081004', 'นางนิตยดา  ทิมจันทึก', 'บธ.บ.การเงิน', 'ครู  คศ.3', 'ปริญญาตรี', '', 'การบัญชี', '0854923847', null, '60220102', '0', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('99', '8081005', 'นางนันทนา  สุวรรณเพชร', 'บธ.บ.การเงินการธนาคาร', 'ครู  คศ.2', 'ปริญญาตรี', '', 'การบัญชี', '0810739326', null, '61320105', '0', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('100', '8084007', 'นางสาวเสาวลักษณ์  ตันติพัฒนานนท์', 'บริหารธุรกิจบัณฑิต  สาาคอมพิวเตอร์', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'คอมพิวเตอร์ธุรกิจ', '0877791953', null, '60220402', '59220401', '0', '8084', '0');
INSERT INTO `teacher` VALUES ('101', '8084008', 'นางสาวรำไพ  อมรเจริญกุล', '-', 'ครู  คศ.1', 'ปริญญาโท', '', 'คอมพิวเตอร์ธุรกิจ', '0868750027', null, '59220403', '60320405', '60420401', '8084', '0');
INSERT INTO `teacher` VALUES ('102', '4041004', 'นายสหชัย  วัดเมือง', 'คบ.อุตสาหกรรมศิลป์', 'ครู  คศ.2', 'ปริญญาตรี', '4041', 'เทคนิคพื้นฐาน', '0814705226', null, '61210206', '0', '0', '4041', '0');
INSERT INTO `teacher` VALUES ('103', '8081008', 'นางสาวศุภศิริ  นาคคำ', 'บัญชี', 'ครู  คศ.1', 'ปริญญาตรี', '', 'การบัญชี', '0878633695', null, '60320105', '0', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('104', '0001003', 'นางเสาวภา  ดิเรกโภค', 'ค.บ.บรรณารักษ์ศาสตร์', 'ครู  คศ.2', 'ปริญญาตรี', '', 'สามัญ', '0895803591', null, '60310403', '60310404', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('105', '2011011', 'นายศักดิ์สิทธิ์  บุญมาก', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างยนต์', '0894243544', null, '60210103', '60210104', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('106', '5052004', 'นายวิรุฬห์  คเชนทร์รัตนกุล', 'คอ.บ.วิศวกรรมโทรคมนาคม', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', '0862472884', null, '61310503', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('107', '6063102', 'นายยศวัฒน์  บุญมาปัด', 'คอ.ม.วิศวกรรมโยธา', 'ครู  คศ.1', 'ปริญญาโท', '', 'ช่างโยธา', '0892814443', null, '59212101', '61312101', '61312105', '6063', '61312106');
INSERT INTO `teacher` VALUES ('109', '8081009', 'นางศิริพร  ปรมะ', 'บริหารธุรกิจบัณฑิต สาขาการบัญชี', 'ครู  คศ.2', 'ปริญญาตรี', '', 'การบัญชี', '0810660654', null, '60220101', '61420101', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('110', '8084009', 'นางสาวมณีรัตน์  พระไตรยะ', 'ครุศาสตร์อุตสาหกรรมบัณฑิต สาขาคอมพิวเตอร์', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'คอมพิวเตอร์ธุรกิจ', '-', null, '0', '0', '0', '8084', '0');
INSERT INTO `teacher` VALUES ('111', '8083001', 'นางเจียมจิตต์  โพธิ์ถิรเลิศ', 'คอ.บ.วิศวกรรมอุตสาหกรรม', 'ครู  คศ.2', 'ปริญญาตรี', '', 'เลขานุการ', '0896262226', null, '0', '0', '0', '8083', '0');
INSERT INTO `teacher` VALUES ('112', '0002009', 'นางสาวลลิตา  ทัพธานี', 'ครุศาสตร์บัณฑิตวิทยาศาสตร์ทั่วไป', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '0892803468', null, '59220102', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('113', '0002016', 'นางสาวสร้อยสุดา  โพธิ์ชัยภูมิ', 'ครุศาสตร์บัณฑิต(คณิตศาสตร์)', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์', '', null, '0', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('114', '2011012', 'นายสมชาย  เจริญผล', '-', 'ครู  คศ.3', 'ปริญญาตรี', '', 'ช่างยนต์', '0823051936', null, '60310103', '0', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('115', '6062003', 'นายชยางกูร  ไชยกิตติ', 'คอ.ม.สถาปัตยกรรม', 'ครู  คศ.1', 'ปริญญาโท', '', 'สถาปัตยกรรม', '0867180638', null, '59210801', '61310801', '61310805', '6062', '0');
INSERT INTO `teacher` VALUES ('116', '5052003', 'นายจุลศักดิ์  ศิริโชติ', 'คอ.ม.บริหารการศึกษา', 'ครู  คศ.2', 'ปริญญาโท', '', 'ช่างอิเล็กทรอนิกส์', '-', null, '61210501', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('117', '8081010', 'นางสาวชลลดา  จันทรแดง', 'บริหารธุรกิจบัณฑิต สาขาการบัญชี', 'ครู  คศ.1', 'ปริญญาตรี', '', 'การบัญชี', '0872412355', '', '61220102', '0', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('118', '8084002', 'นายปิยะ  วันทาแท่น', '-', 'ครู  คศ.1', 'ปริญญาโท', '', 'คอมพิวเตอร์ธุรกิจ', '0898562209', null, '61320403', '60320403', '0', '', '0');
INSERT INTO `teacher` VALUES ('119', '8081011', 'นางสาวนิภาวรรณ   ภุูศรีจัน', 'บริหารธุรกิจบัณฑิต สาขาบัญชี', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'การบัญชี', '0833839990', null, '61320106', '0', '0', '8081', '0');
INSERT INTO `teacher` VALUES ('120', '8084003', 'นางสารภี  แต่งผิว', 'คอมพิวเตอร์และเทคโนโลยีสารสนเทศ(คอม.)', 'ครู  คศ.1', 'ปริญญาโท', '', 'คอมพิวเตอร์และเทคโนโลยีสารสนเทศ(คอม.)', '0897162237', null, '61220402', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('121', '3331004', 'นายอุทัย  คตภูธร', 'คอ.บ.วิศวกรรมอุตสาหกรรม', 'ครู  คศ.1', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '0801958145', null, '61310201', '61310202', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('122', '0001006', 'นายปรีชา  อารีวงษ์', 'ศิลปศาตร์บัณฑิต สาขาสังคม', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สามัญ', '0879585566', null, '60310505', '0', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('123', '6062005', 'นางสุจิตราภรณ์  ศรีสวัสดิ์', 'ครุศาสตร์บัณฑิต สาขาเทคนิคสถาปัตยกรรม', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สถาปัตยกรรม', '0812657826', null, '60210801', '59210801', '61310801', '6062', '61310805');
INSERT INTO `teacher` VALUES ('124', '6062006', 'นายจักพันธ์  ประสพเงิน', 'ครุศาสตร์บัณฑิต สาขาเทคนิคสถาปัตยกรรม', 'ครูจ้างสอน', 'ปริญญาตรี', null, 'สถาปัตยกรรม', '0869977212', null, '60310801', '60310805', '0', '6062', '0');
INSERT INTO `teacher` VALUES ('125', '2011013', 'นายกิตติพงษ์  ยืดยาว', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างยนต์', '', null, '60210107', '60210108', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('126', '2011014', 'นายพิทักษ์  รวมขุนทด', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างยนต์', '', null, '61210109', '59210105', '59210106', '2011', '0');
INSERT INTO `teacher` VALUES ('127', '2011002', 'นายวินัย  จันทร์ขามป้อม', '-', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ช่างยนต์', '', null, '60210101', '60210102', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('162', '3032008', 'นายกฤษณชนม์  คำศรีสุข', null, 'ครู คศ.1', 'ปริญญาตรี', '', 'ช่างเชื่อมโลหะการ', null, null, '61210301', '60410201', '59210301', '3032', '0');
INSERT INTO `teacher` VALUES ('128', '5051017', 'นายไพบูลย์  ตั้งจรูญถาวร', 'บธ.ม.บริหารธุรกิจ', 'ครู  คศ.1', 'ปริญญาโท', '', 'ไฟฟ้ากำลัง', '0815479117', null, '61210403', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('130', '8084004', 'นายปรีชา  ปรือปรัง', 'ครุศาสตร์อุตสาหกรรมบัณฑิต สาขาคอมพิวเตอร์ธุรก', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'คอมพิวเตอร์ธุรกิจ', '-', null, '0', '0', '0', '8084', '0');
INSERT INTO `teacher` VALUES ('172', '0002019', 'Mr. Divine Toh kom', null, 'ครูจ้างสอนต่างชาติ', 'ครูต่างชาติ', null, 'สามัญสัมพันธ์', null, null, '0', '0', '0', '0002', null);
INSERT INTO `teacher` VALUES ('174', '2011015', 'นายอนุชา คำนนอินทร์', null, 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างยนต์', null, null, '0', '0', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('179', '5051018', 'นายโกวิท  พันธุ์ทอง', 'ค.อ.บ วิศวกรรรมไฟฟ้ากำลัง', 'ครู  คศ.2', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', null, null, '0', '0', '0', '5051', '0');
INSERT INTO `teacher` VALUES ('180', '0002020', 'Mr.Glen  H.Weyer  II', null, 'ครูจ้างสอนต่างชาติ', 'ครูต่างชาติ', null, 'สามัญสัมพันธ์', null, null, null, null, null, '0002', null);
INSERT INTO `teacher` VALUES ('181', '7071003', 'นางสาวกฤษณา  แนววิเศษ', 'คอม.คอมพิวเตอร์และเทคโนโลยีสารสนเทศ', 'ครูประจำ', 'ปริญญาโท', '7071', 'เทคโนโลยีสารสนเทศ', null, null, '59290101', '59290102', '0', '7071', '0');
INSERT INTO `teacher` VALUES ('182', '0002017', 'นางเข็มพร  ทันสมัย', null, 'ครูจ้างสอนต่างชาติ', 'ครูต่างชาติ', null, 'สัมพันธ์', null, null, null, null, null, '0002', null);
INSERT INTO `teacher` VALUES ('183', '6062007', 'นายอนุรักษ์  หม่องนัน', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'สถาปัตยกรรม', null, null, null, null, null, '6062', null);
INSERT INTO `teacher` VALUES ('184', '6062008', 'นายดนุพล  ทาบุญ', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'สถาปัตยกรรม', null, null, null, null, null, '6062', null);
INSERT INTO `teacher` VALUES ('186', 'admin', 'ผู้ดูแลระบบ', 'ผู้ดูแลระบบ', 'ครูจ้างสอน', null, null, null, null, null, null, null, null, '', null);
INSERT INTO `teacher` VALUES ('187', '5052014_14', 'นางชุติญา  อัยยะ', null, 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', null, null, '0', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('188', '2011016', 'นายไกรภูมิ  คำนาค', null, 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างยนต์', null, null, '61310103', '61310104', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('189', '0002021', 'นางสาวเณตรนรินทร์   ชื่นใส', null, 'ครู  คศ.2', 'ปริญญาตรี', null, 'สัมพันธ์', null, null, '61210301', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('190', '2011017', 'นายเฉลิมวุฒิ  อาจกมล', null, 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างยนต์', null, null, '61210105', '61210106', '0', '2011', '0');
INSERT INTO `teacher` VALUES ('191', '6063104', 'นายสุริยา  พลทะยาน', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างโยธา', null, null, '60212101', '60212102', '0', '6063', '0');
INSERT INTO `teacher` VALUES ('192', '8084010', 'นางสาวมณีรัตน์  ประดับค่าย', null, 'ครูจ้างสอน', 'ปริญญาตรี', '', 'คอมพิวเตอร์ธุรกิจ', null, null, '61220401', '59220402', '0', '8084', '0');
INSERT INTO `teacher` VALUES ('200', '8084011', 'นางนันท์นภัส  คำวชิรพิทักษ์', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'คอมพิวเตอร์ธุรกิจ', null, null, '61320401', '0', '0', '8084', '0');
INSERT INTO `teacher` VALUES ('201', '3331012', 'นายอภิโชค  พรหมจันทร์', null, 'ครูอัตราจ้าง', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', null, null, '61210205', '0', '0', '3331', '0');
INSERT INTO `teacher` VALUES ('203', '0002022', 'นายอนุศาสน์   ปาทา', null, 'ครู  คศ.2', 'ปริญญาตรี', '0001', 'สัมพันธ์', null, null, '61210201', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('204', '0002023', 'Mrs.Edela Mojoko Eko Molue', null, 'ครูจ้างสอนต่างชาติ', 'ครูต่างชาติ', null, 'สามัญสัมพันธ์', null, null, null, null, null, '0002', null);
INSERT INTO `teacher` VALUES ('205', '0002024', 'Mr.Mathew  Williams', null, 'ครูจ้างสอนต่างชาติ', 'ครูต่างชาติ/ภาษาอังกฤษ', null, 'สามัญสัมพันธ์', null, null, null, null, null, '0002', null);
INSERT INTO `teacher` VALUES ('206', '9009', 'งานกิจกรรม', 'งานกิจกรรม', 'งานกิจกรรม', null, null, 'งานกิจกรรม', null, null, null, null, null, null, null);
INSERT INTO `teacher` VALUES ('208', '7071004', 'นายอลงกรณ์  ภูคงคา', null, 'ครู  คศ.3', 'ปริญญาโท', null, 'เทคโนโลยีสารสนเทศ', null, null, '60390101', '60390105', '0', '7071', '0');
INSERT INTO `teacher` VALUES ('210', '3331014', 'นายบุรินทร์  อ่อนมี', null, 'ครู  คศ.1', 'ปริญญาตรี', null, 'ช่างกลโรงงาน', null, null, '60310205', '60310206', '0', null, '0');
INSERT INTO `teacher` VALUES ('211', '2011020', 'นายศรรตยา  พิณพาทย์', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างยนต์', null, null, '61310107', '61310108', '60310107', null, '60310108');
INSERT INTO `teacher` VALUES ('212', '2011018', 'นายวสันต์  สมวงษ์สา', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างยนต์', null, null, '0', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('213', '2011019', 'นายณัฐกรณ์  พั้วสุ', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างยนต์', null, null, '61210103', '61210104', '59210103', null, '0');
INSERT INTO `teacher` VALUES ('214', '8084012', 'นางตุ๊กตา  นารีรักษ์', null, 'ครู', 'ปริญญาตรี', null, 'แผนกคอมพิวเตอร์ธุระกิจ', null, null, '0', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('215', '0002027', 'นางพัชรี  ภูสีอ่อน', null, 'ครู', 'ปริญญาตรี', null, 'สัมพันธ์', null, null, '60210301', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('216', '0002028', 'นายพุทธิศักดิ์  อุดมเศรษฐ์', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'แผนกสัมพันธ์', null, null, '0', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('217', '0002025', 'Ms.Hu Jie', null, 'ครูจ้างสอนต่างชาติ', 'ครูต่างชาติ/ภาษาจีน', null, 'สามัญสัมพันธ์', null, null, null, null, null, null, null);
INSERT INTO `teacher` VALUES ('218', '0002026', 'Ms.Liu  Meng Jun', null, 'ครูจ้างสอนต่างชาติ', 'ครูต่างชาติ/ภาษาจีน', null, 'สามัญสัมพันธ์', null, null, null, null, null, null, null);
INSERT INTO `teacher` VALUES ('219', '2011021', 'นายธีรศักดิ์  สาวะถี', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างยนต์', null, null, '59210110', '59210111', '0', null, '0');
INSERT INTO `teacher` VALUES ('220', '2011022', 'นายณัฐวุฒิ  ดื่มโชค', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างยนต์', null, null, '61310105', '61310106', '0', null, '0');
INSERT INTO `teacher` VALUES ('221', '2011023', 'นายภัทรพล  ระโยธี', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างยนต์', null, null, '60210105', '60210106', '0', null, '0');
INSERT INTO `teacher` VALUES ('222', '3331015', 'นายฉัตรมงคล  มาตรเมือง', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างกลโรงงาน', null, null, '60210205', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('223', '8084012', 'นางตุ๊กตา  นารีรักษ์', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'คอมพิวเตอร์ธุระกิจ', null, null, '0', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('224', '8084013', 'นายกฤตเมธ  เกิดบ้านเป้า', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'คอมพิวเตอร์ธุระกิจ', null, null, '60320401', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('225', '5051019', 'นายอนันท์  รักษาวัง', null, 'ครูอัตราจ้าง', 'ปริญญาตรี', null, 'ไฟฟ้ากำลัง', null, null, '61210404', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('226', '5051020', 'นายณฐปกรณ์  อิ่มเหว่า', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ไฟฟ้ากำลัง', null, null, '61210407', '59210404', '0', null, '0');
INSERT INTO `teacher` VALUES ('227', '5051021', 'นายจักรพันธุ์  ทองจำรูญ', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ไฟฟ้ากำลัง', null, null, '61310404', '0', '0', null, '0');
INSERT INTO `teacher` VALUES ('228', '0002029', 'Mr.Brian  J.Harrison', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'สามัญสัมพันธ์', null, null, null, null, null, null, null);
INSERT INTO `teacher` VALUES ('229', '3331016', 'นายสุพล  หาญชนะ', '-', 'ครู', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '0866525943', null, '60310201', '60310202', '0', '3331016', '0');
INSERT INTO `teacher` VALUES ('230', '0002030', 'นางปัณฑิกา  ไชยกิตติ ', '-', 'ครู', 'ปริญญาตรี', '', 'สัมพันธ์/ภาษาอังกฤษ', '0866525943', null, '61210801', '61210802', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('231', '0002031', 'นางอารีรัตน์  อารีวงษ์ ', '-', 'ครู', 'ปริญญาตรี', '', 'สัมพันธ์/ภาษาอังกฤษ', '0866525943', null, '60210203', '60210204', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('232', '0001008', 'นายณัฐวัฒน์  เข็มตรง', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์/พลานามัย', '0866525943', null, '61210204', '0', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('233', '0001009', 'นางพิมพาพร  กลิ่นจันทร์แดง ', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สัมพันธ์/พลานามัย', '0866525943', null, '0', '0', '0', '0001', '0');
INSERT INTO `teacher` VALUES ('234', '4041006', 'นายวัชระ  ประเสริฐนู', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'เทคนิคพื้นฐาน', '0866525943', null, '61210204', '0', '0', '0', '0');
INSERT INTO `teacher` VALUES ('235', '3032009', 'นางสาวรัญญา  ชื่นเมือง ', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างเชื่อมโลหะการ', '0866525943', null, '60210301', '0', '0', '3032', '0');
INSERT INTO `teacher` VALUES ('236', '5052014', 'นายณัฐดนัย  ชมภูพาน', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', '0866525943', null, '61210502', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('237', '5052015', 'นายวัชราวุธ  สอนชัยภูมิ ', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ช่างอิเล็กทรอนิกส์', '0866525943', null, '61310505', '0', '0', '5052', '0');
INSERT INTO `teacher` VALUES ('238', '7071005', 'นายเจษฎา  มาประเสริฐ ', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'เทคโนโลยีสารสนเทศ', '0866525943', null, '60290101', '0', '0', '7071', '0');
INSERT INTO `teacher` VALUES ('239', '0002032', 'Mr.Bishnu Rai ', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สามัญสัมพันธ์', '0866525943', null, '0', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('240', '0002033', 'Mr.Namgay  Wangdi ', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'สามัญสัมพันธ์', '0866525943', null, '0', '0', '0', '0002', '0');
INSERT INTO `teacher` VALUES ('241', '5051022', 'นางสาวกมลทิพย์  วรพล', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0862559018', null, '60310406', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('242', '5051023', 'นายสุรพงศ์  พรมชีลอง', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0862559018', null, '59210403', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('243', '5051024', 'นายนคร  ยืนนาน', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', 'ไฟฟ้ากำลัง', '0862559018', null, '60210403', '60210404', '0', '', '0');
INSERT INTO `teacher` VALUES ('244', '6063105', 'นายวันชัย  ชำนาญศรี', '-', 'รองผู้อำนวยการฝ่ายวิ', 'ปริญญาโท', '', '', '', null, '', '', '0', '', '0');
INSERT INTO `teacher` VALUES ('245', '8082004', 'นางสาวจารุณี  คบสหาย', '-', 'ครูจ้างสอน', 'ปริญญาตรี', '', '', '', null, '61320201', '61320205', '60320201', '', '60320205');
INSERT INTO `teacher` VALUES ('246', '3331008', 'นายโชคชัย  มูลกว้าง', null, 'ครู ค.ศ.1', 'ปริญญาตรี', null, 'ช่างกลโรางงาน', null, null, '61210201', '0', '0', '6063', '0');
INSERT INTO `teacher` VALUES ('247', '0001010', 'นายมงคล  ภูสิลิต', null, 'ครูอัตราจ้าง', 'ปริญญาตรี', null, 'สามัญ', null, null, '61210203', '0', '0', '6063', '0');
INSERT INTO `teacher` VALUES ('248', '8082005', 'นายรัชภูมิ  คุ้มบุ่งคล้า', null, 'ครูอัตราจ้าง', 'ปริญญาตรี', null, 'การขายและการตลาด', null, null, '61220201', '60220201', '59220201', '6063', '0');
INSERT INTO `teacher` VALUES ('249', '6061004', 'นางใจแก้ว  ศิริโชติ', null, 'ครูอัตราจ้าง', 'ปริญญาตรี', null, 'ช่างก่อสร้าง', null, null, '0', '0', '0', '6063', '0');
INSERT INTO `teacher` VALUES ('250', '3032010', 'นายกฤษดา  อภัยนอก', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างเชื่อมโลหะ', null, null, '59210302', '0', '0', '6063', '0');
INSERT INTO `teacher` VALUES ('251', '6063107', 'นายเจษฎา  จิตแสง', null, 'ครูจ้างสอน', 'ปริญญาตรี', null, 'ช่างโยธา', null, null, '61212101', '61212102', '0', '6063', '0');
INSERT INTO `teacher` VALUES ('252', '3331017', 'นายชัยชนะ  ชิระบุตร', '', 'ครูอัตราจ้าง', 'ปริญญาตรี', '', 'ช่างกลโรงงาน', '', null, '', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('253', '5051025', 'นายนภัทร  จงใจภักดิ์', '', 'ครูอัตราจ้าง', 'ปริญญาตรี', '', 'ช่างไฟฟ้ากำลัง', '', null, '60310401', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('254', '5051026', 'นายณัฐวัฒน์  ชูศรี', '', 'ครูอัตราจ้าง', 'ปริญญาตรี', '', 'ช่างไฟฟ้ากำลัง', '', null, '61210406', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('255', '6063106', 'นางสาวพัชรี   ศรีน้อย', '', 'ครูอัตราจ้าง', 'ปริญญาตรี', '', 'ช่างโยธา', '', null, '61312107', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('261', '6061005', 'นางสาวประภาพร  โคกแดง', '', '', 'ครูจ้างสอน', '', 'ปริญญาตรี', '', null, '0', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('262', '5051027', 'นายวิสุทธิ์  บุญเสริม', '', '', 'ครูประจำแผนกวิชาช่างไฟฟ้ากำลัง', '', 'ปริญญาโท', '', null, '0', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('263', '5051028', 'นายกิตติ  แผ่นเงิน', '', '', 'ครูประจำแผนกวิชาช่างไฟฟ้ากำลัง', '', 'ปริญญาโท', '', null, '0', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('264', '5051029', 'นายสุทธิชัย  สิงห์ลา', '', '', 'ครูประจำแผนกวิชาช่างไฟฟ้ากำลัง', '', 'ปริญญาตรี', '', null, '0', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('265', '3032011', 'นายจตุพล  สีสุข', '', '', 'ครูอัตราจ้าง', '', 'ปริญญาตรี', '', null, '0', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('266', '0002034', 'Mr.Beall  Brandon', '', 'ครูต่างชาติ', 'ครูอัตราจ้าง', '', 'สามัญสัมพันธ์', '', null, '0', '0', '0', '', '0');
INSERT INTO `teacher` VALUES ('267', '0002035', 'Mr.Anthony Lee Fitzsimmons Reysen', '', 'ครูต่างชาติ', 'ครูอัตราจ้าง', '', 'สามัญสัมพันธ์', '', null, '0', '0', '0', '', '0');

-- ----------------------------
-- Table structure for `work_time`
-- ----------------------------
DROP TABLE IF EXISTS `work_time`;
CREATE TABLE `work_time` (
  `work_id` int(11) NOT NULL AUTO_INCREMENT,
  `person_id` varchar(10) NOT NULL,
  `start_time` datetime NOT NULL,
  `end_time` datetime NOT NULL,
  `date_in` time NOT NULL,
  `date_out` time NOT NULL,
  `now_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `status` varchar(30) NOT NULL,
  PRIMARY KEY (`work_id`)
) ENGINE=InnoDB AUTO_INCREMENT=84 DEFAULT CHARSET=utf8mb4;

-- ----------------------------
-- Records of work_time
-- ----------------------------
INSERT INTO `work_time` VALUES ('71', '7071002', '2019-06-06 23:16:16', '0000-00-00 00:00:00', '23:16:16', '23:49:28', '2019-06-06 23:49:28', 'มาทำงาน');
INSERT INTO `work_time` VALUES ('72', '7071004', '2019-06-06 23:18:49', '0000-00-00 00:00:00', '23:18:49', '00:00:00', '2019-06-06 23:18:50', '1');
INSERT INTO `work_time` VALUES ('73', '7071004', '2019-06-06 23:18:55', '0000-00-00 00:00:00', '23:18:55', '00:00:00', '2019-06-06 23:18:55', '1');
INSERT INTO `work_time` VALUES ('74', '7071004', '2019-06-06 23:18:55', '0000-00-00 00:00:00', '23:18:55', '00:00:00', '2019-06-06 23:18:55', '1');
INSERT INTO `work_time` VALUES ('75', '7071004', '2019-06-06 23:18:55', '0000-00-00 00:00:00', '23:18:55', '00:00:00', '2019-06-06 23:18:55', '1');
INSERT INTO `work_time` VALUES ('76', '7071004', '2019-06-06 23:18:55', '0000-00-00 00:00:00', '23:18:55', '00:00:00', '2019-06-06 23:18:55', '1');
INSERT INTO `work_time` VALUES ('77', '7071004', '2019-06-06 23:18:56', '0000-00-00 00:00:00', '23:18:56', '00:00:00', '2019-06-06 23:18:56', '1');
INSERT INTO `work_time` VALUES ('78', '7071001', '2019-06-06 23:18:59', '0000-00-00 00:00:00', '23:18:59', '00:00:00', '2019-06-06 23:18:59', '1');
INSERT INTO `work_time` VALUES ('79', '7071001', '2019-06-06 23:18:59', '0000-00-00 00:00:00', '23:18:59', '00:00:00', '2019-06-06 23:18:59', '1');
INSERT INTO `work_time` VALUES ('80', '7071001', '2019-06-06 23:18:59', '0000-00-00 00:00:00', '23:18:59', '00:00:00', '2019-06-06 23:18:59', '1');
INSERT INTO `work_time` VALUES ('81', '7071004', '2019-06-06 23:19:02', '0000-00-00 00:00:00', '23:19:02', '00:00:00', '2019-06-06 23:19:02', '1');
INSERT INTO `work_time` VALUES ('82', '7071003', '2019-06-06 23:49:38', '0000-00-00 00:00:00', '23:49:38', '00:00:00', '2019-06-06 23:49:38', '2');
INSERT INTO `work_time` VALUES ('83', '7071002', '2019-06-07 01:01:23', '0000-00-00 00:00:00', '01:01:23', '00:00:00', '2019-06-07 01:01:23', '2');
